-- 商品規格
CREATE TABLE specs (
	spec_id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
	product_id INT NOT NULL,
	price INT NOT NULL,
	color VARCHAR(50) NOT NULL,
	stock INT NOT NULL,
	material VARCHAR(50),
	size VARCHAR(50),
	weight INT,
	origin VARCHAR(50),
	created DATETIME DEFAULT CURRENT_TIMESTAMP,
	updated DATETIME DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
	FOREIGN KEY (product_id) REFERENCES products(product_id)
);

INSERT INTO specs (spec_id, product_id, price, color, stock, material, size, weight, origin) VALUES
(1, 1, 3800, '咖啡', 50, '透氣網布與耐磨橡膠', '27', 380, '越南'),
(2, 2, 2200, '橘', 100, '高級合成皮革', '24', 600, '泰國'),
(3, 3, 4500, '橘白', 40, '輕量化合成革', '26', 420, '印尼'),
(4, 4, 980, '彩色', 120, '耐磨PU材質', '22', 430, '巴基斯坦'),
(5, 5, 7500, '原色', 20, '頂級牛皮', '30', 650, '日本'),
(6, 6, 3200, '藍白', 35, '高強度鋁合金', '81', 750, '美國'),
(7, 7, 6800, '紅', 25, '碳纖維複合材料', '68', 295, '中國'),
(8, 8, 250, '黃', 200, '高彈性毛氈與橡膠', '7', 58, '台灣'),
(9, 9, 5500, '黑黃', 30, '高剛性碳纖維', '67', 83, '日本'),
(10, 10, 750, '白', 150, '天然鵝毛', '8', 60, '中國'),
(11, 11, 2000, '三色', 70, '超細纖維PU皮', '21', 270, '泰國'),
(12, 12, 1800, '紅黑', 50, '純木底板與進口膠皮', '15x16', 185, '日本'),
(13, 13, 300, '橘', 100, 'ABS新材料', '4', 3, '中國'),
(14, 14, 1200, '紅', 60, '強化PU皮革', '28', 340, '巴基斯坦'),
(15, 15, 800, '藍', 50, '鑄鐵與強化塑膠', '35', 2000, '中國'),
(16, 16, 3200, '黑', 30, '合成皮革與高密度鞋底', '27', 450, '越南'),
(17, 17, 900, '藏青色', 40, 'TPE環保材質', '183*61', 950, '台灣'),
(18, 18, 750, '黑', 100, 'TPE環保材質', '183*61', 850, '中國'),
(19, 19, 1500, '紅白', 40, '乳膠與PU', '28', 380, '德國'),
(20, 20, 2200, '藍', 30, '輕量化鋁合金', '57', 450, '台灣'),
(21, 21, 650, '黃藍', 70, 'EVA與彈性布料', '25', 230, '中國'),
(22, 22, 700, '紅黑白', 90, '五層純木底板與入門級反膠', '24*16', 175, '日本');